#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//程序1 数据类型的基本归类
//整形家族：
//	char
//		unsigned char
//		signed char
//	short
//		unsigned short[int]
//		signed short[int]
//	int
//		unsigned int
//		signed int
//	long
//		unsigned long[int]
//		signed long[int]
//浮点数家族：
//	float
//	double
//构造类型：
//	数组类型
//	结构体类型 struct
//	枚举类型 enum
//	联合类型 union
//指针类型：
//	int* pi;
//	char* pc;
//	float* pf;
//	void* pv;
//空类型：
//	void 表示空类型（无类型）
//	通常应用于函数的返回类型、函数的参数、指针类型。

////程序2 整型在内存中的存储（原码、反码、补码）
//int main()
//{
//	int a = -10;
//	// 
//	//10000000000000000000000000001010-原码
//	//11111111111111111111111111110101-反码
//	//11111111111111111111111111110110-补码
//	//FFFFFFF6
//
////数据在内存中以2进制的形式存储 
////对于整数来说:整数二进制有3种表示形式:原码、反码、补码 
////正整数 : 原码、反码、补码相同
////负整数 : 原码、反码、补码要进行计算的
////按照数据的数值直接写出的二进制序列就是原码
////原码的符号位不变，其他位按位取反，得到的就是反码"反码+1，得到的就是补码
////注意：负数的补码变原码也是一样的计算过程
//// 
////整数中在内存中存储的是补码
////其中原因：
//	1 - 1;
//	1 + (-1);
//	//原码计算
//	//00000000000000000000000000000001	1
//	//10000000000000000000000000000001	-1
//	//10000000000000000000000000000010	-2
//	//补码计算
//	//00000000000000000000000000000001	1
//	//11111111111111111111111111111111	-1
//	//100000000000000000000000000000000  最开头的一位放不下丢了，所以32个0
//
//	return 0;
//}

////程序3 整型在内存中的存储（大端小端）
////大端（存储）模式，是指数据的低位保存在内存的高地址中，而数据的高位，保存在内存的低地址中；
////小端（存储）模式，是指数据的低位保存在内存的低地址中，而数据的高位, 保存在内存的高地址中。
//int main()
//{
//	//int a = -10;
//	// 
//	//10000000000000000000000000001010-原码
//	//11111111111111111111111111110101-反码
//	//11111111111111111111111111110110-补码
//	//FFFFFFF6  在内存中是倒着读，和大端小端有关
//
//	int a = 0x11223344;
//	//44就是地位，11就是高位
//	//就像个十百千万那样
//
//	return 0;
//}

////程序4 写代码判断当前机器是大端还是小端
//int check_sys()
//{
//	int a = 1;
//	char* p = (char*)&a;
//	return *p;//返回1为小端，否则0为大端
//}
//int main()
//{
//	//int a = 1;
//	//char* p = (char*)&a;//int*
//	//if (*p == 1)
//	//	printf("小端\n");
//	//else
//	//	printf("大端\n");
//
//	//函数
//	int ret = check_sys();
//	if (ret)
//		printf("小端\n");
//	else
//		printf("大端\n");
//
//	return 0;
//}

////程序5 练习1
//int main()
//{
//	char a = -1;
//	//11111111
//	signed char b = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111
//	unsigned char c = -1;
//	//10000000000000000000000000000001
//	//11111111111111111111111111111110
//	//11111111111111111111111111111111
//	//11111111
//	//00000000000000000000000011111111
//	//255
//
//	printf("a=%d,b=%d,c=%d", a, b, c); //-1 -1 255
//
//	return 0;
//}
////补充：
////1.char 到底是unsigned char 还是signed char
////C语言标准中没有规定，取决于编译器
////2.int 是signed int
////3.short 是signed short

////程序5 练习2
//int main()
//{
//	char a = -128;
//	//10000000000000000000000010000000
//	//11111111111111111111111110111111
//	//11111111111111111111111111000000
//	//10000000
//	//11111111111111111111111110000000
//	printf("%u\n", a);//4294967168
//	//%u是无符号数输出
//
//	return 0;
//}

////程序6 练习3
//int main()
//{
//	char a = 128;
//	//00000000000000000000000010000000
//	//10000000
//	//11111111111111111111111110000000
//	printf("%u\n", a);//4294967168
//
//	//char的取值范围探讨
//	//有符号：-128 -- 127
//	//无符号：0 -- 255
//
//	return 0;
//}

////程序7 练习4
//int main()
//{
//	int i = -20;
//	//10000000000000000000000000010100
//	//11111111111111111111111111101011
//	//11111111111111111111111111101100
//	// 
//	//00000000000000000000000000001010
//	// 
//	//11111111111111111111111111110110
//	//11111111111111111111111111110101
//	//10000000000000000000000000001010
//	unsigned int j = 10;
//	printf("%d\n", i + j);//-10
//
//	return 0;
//}

////程序8 练习5
//int main()
//{
//	unsigned int i;
//	for (i = 9; i >= 0; i--)
//	{
//		printf("%u\n", i);	//死循环
//	}
//
//	return 0;
//}

////程序8 练习6
//int main()
//{
//	char a[1000];
//	int i;
//	for (i = 0; i < 1000; i++)
//	{
//		a[i] = -1 - i;
//	}
//	//-1 -2 -3 …… -127 -128 127 126 …… 3 2 1 0 -1 -2 ……
//	//128+127
//	printf("%d", strlen(a));//255
//	//找\0 -> 0
//
//	return 0;
//}

//程序9 练习7
unsigned char i = 0;
int main()
{
	for (i = 0; i <= 255; i++)
	{
		printf("hello world\n");	//死循环
	}
	return 0;
}