#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

//操作符

//程序1 算术操作符：+ - * / %
//int main()
//{
//	int a = 9 / 2;
//	int b = 9 / 2.0;	//无意义
//	
//	float c = 9 / 2;
//	float e = 9 / 2.0;	//除号两边不同类型就以小数点多的为准，输出数字小数点数
//
//	int g = 9 % 2;		//取模(余数)
//
//	printf("%d %d %f %f %d", a, b, c, e, g);
//
//	return 0;
//}

//程序2 移位操作符:<< >>	
//移动的都是二进制位
//int main()
//{
//	int a = 2;
//	int b = a << 2;
//
//	printf("%d\n", b);
//
//	return 0;
//}

//程序3 位操作符：&(按位与)  ^(按位异或)  |(按位或)
//赋值操作符: =  +=  -=  *=  /=  &=  ^=  |=  >>=  <<=
//int main()
//{
//	int a = 2;
//	//a = a + 5;		//此处写法相当于下一行
//	a += 5;
//
//	int b = 2;
//	//b = b - 1;
//	b -= 3;
//
//	int c = 5;
//	//c = c % 3;
//	c %= 3;
//
//	printf("%d\n%d\n%d\n", a, b, c);
//
//	return 0;
//}

//程序4 举例：双目操作符：有两个操作数（a+b，+有两个）
//		      单目操作符：	！ 逻辑反操作
//							- +  负值 正值
//							&  取地址
//							(类型)  强制类型转换
//							sizeof  操作数的类型长度(以字节为单位)
//							~  对一个数的二进制按位取反
//							--  前置、后置--
//							++  前置、后置++
//							*  间接访问操作符(解引用操作符)
//int main()
//{
//	//C语言中0表示假，非0表示真
//	int a = 0;
//	printf("%d\n", !a);		//真非0的为0，假a=0表示1，此两行用来说明语法，下面为用处
//
//	if (a)
//	{
//		//如果a为真，做事
//	}
//	if (!a)
//	{
//		//如果a为假，做事
//	}
//
//	//a = -5;
//	//a = -a;
//	//a = +a;				//+-表示正负值
//
//	int b = 4;
//	printf("%d\n", sizeof(int));
//	printf("%d\n", sizeof(a));		//sizeof是操作符而不是函数，用来计算类型或变量的大小
//	printf("%d\n", sizeof a );		//括号可以省略
//
//	int arr[10] = { 0 };
//	printf("%d\n", sizeof arr);		//也可以计算数组总大小,单位是字节，此处10*4=40（int为4，有10个数）
//	printf("%d\n", sizeof(arr[0])); //4
//	
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	printf("%d\n", sz);				//此次计算多少个元素
//
//	int a = 0;
//	
//	printf("%d\n", ~a);		//~按(二进制位)位取反：把所以二进制位中的数字，1变0，0变1
//							//原码，反码，补码
//
//	int a = 10;
//	int b = a++;		//后置++：先使用，后++
//	printf("%d\n", b);//10
//	printf("%d\n", a);//11
//
//	int b = ++a;		//前置++：先++，后使用
//	printf("%d\n", b);//11
//	printf("%d\n", a);//11
//
//	错误代码写法
//	int a = 1;
//	int b = (++a) + (++a) + (++a);
//	printf("%d\n", b);//打印虽然是12，但有些编译器会出现不同结果
//
//	double a = (int)3.14;		//强制类型转换
//	printf("%f\n", a);
//
//	return 0;
//}

//程序5 关系操作符：>  >=  <  <=  !=(用于测试“不相等”)  ==(用于测试“相等”)  
//      逻辑操作符：&&（逻辑与）  ||（逻辑或）
//int main()
//{
//	//int a = 3;
//	//int b = 5;
//	//int c = a && b;
//	//printf("%d\n", c);//1,必须都是真
//
//	//int b = 0;
//	//int c = a && b;
//	//printf("%d\n", c);//0,有一个是假就是不行
//
//	//int a = 3;
//	//int b = 0;
//	//int c = a || b;
//	//printf("%d\n", c);//1,有一个为真就行
//
//	int a = 0;
//	int b = 0;
//	int c = a || b;
//	printf("%d\n", c);//0，都是假
//
//	return 0;
//}

//程序6 条件操作符(三木操作符)：exp1?exp2:exp3
//								exp1成立,exp2计算,整个表达式结构是exp2的结果，否则exp3计算且是exp3的结果
//int main()
//{
//	int a = 0;
//	int b = 3;
//	int max = 0;
//	
//	//if (a > b)
//	//{
//	//	max = a;
//	//}
//	//else
//	//{
//	//	max = b;
//	//}
//
//	//三木操作符表示
//	max = a > b ? a : b;
//
//	printf("%d\n", max);
//
//	return 0;
//}

//程序7 下标引用[]  函数调用()  结构  .  ->
//		逗号表达式：逗号隔开的一串表达式，是从左向右依次计算，整个表达式结果是最后一个表达式结果
int main()
{
	int a = 0;
	int b = 4;
	int c = 2;

	int d = (a = b + 4, c = a - 5, b = c + 1);
	printf("%d\n", d);

	return 0;
}
