#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

////程序1 数组：一组相同类型元素的集合
////一维数组的创建
//int main()
//{
//	int arr[8];
//	char ch[5];	//[]里面要是一个常量
//
//	/*//错误：
//	int n = 8;
//	int arr[n];//n是变量，但C99支持长数组*/
//
//	return 0;
//}

////程序2 数组的初始化
//int main()
//{
//	//整型
//	int a = 10;//初始化
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };	//完全初始化
//	int arr1[10] = { 1,2,3,4,5 };			//不完全初始化
//	int arr2[] = { 1,2,3,4,5 };				//会根据后面的元素确定大小
//
//	//字符
//	char ch1[5] = { 'b','i','t' };
//	char ch2[] = { 'b','i','t' };
//	char ch3[5] = "bit";	//b i t \0 0
//	char ch4[] = "bit";		//b i t \0
//
//	char ch5[] = "bit";
//	//[b i t \0]
//	char ch6[] = { 'b','i','t' };
//	//[b i t]
//	printf("%s\n", ch5);
//	printf("%s\n", ch6);	//前后空间不知道是什么，出现乱码。因为没有\0停止
//
//	printf("%d\n", strlen(ch5));	//有确定值3
//	printf("%d\n", strlen(ch6));	//随机值
//
//	return 0;
//}

////程序3 一维数组的使用
//int main()
//{
//	int arr[10] = { 0 };//不完全初始化
//	arr[4] = 5;	//[] - 下标引用操作符
//	int i = 0;
//	printf("%d\n", sizeof(arr));
//	printf("%d\n", sizeof(arr[0]));
//	printf("------------------\n");
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	for (i = 0; i < sz; i++)
//	{
//		printf("%d ", arr[i]);//这时的i是访问元素，所以可以用
//	}
//
//	return 0;
//}

////程序4 一维数组在内存中的存储
////%p - 是按地址的格式打印 - 16进制的打印
//int main()
//{
//	printf("%x\n", 0x12);
//	printf("%p\n", 0x12);
//
//	printf("-----------------\n");
//
//	int arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("&arr[%d] = %p\n", i, &arr[i]);	//1.每个地址相隔4个字节，并且是连续存放的
//	}											//2.随着数组下标增长，地址是由低到高变化的
//
//	return 0;
//}

////程序5 验证数组的连续
//int main()
//{
//	int arr[10] = { 1,2,3,4,5,6,7,8,9,10 };
//	int* p = arr;//数组名是数组首元素的地址
//	int i = 0;
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d ", *p);
//		p++;
//	}
//
//	return 0;
//}

////程序6 二维数组的创建和初始化
//int main()
//{
//	//创建
//	int arr0[3][4];
//	char ch0[3][10];
//	//初始化 - 创建的同时给赋值
//	int arr1[3][4] = { 1,2,3,4,5,6,7,8,9,10,11,12 };
//	int arr2[3][4] = { 1,2,3,4,5,6,7 };		//不完全初始化 - 后面补0
//	int arr3[3][4] = { {1,2},{3,4},{4,5} };
//	int arr4[][4] = { {1,2},{3,4},{4,5} };	//行可以省略，列不可以省略
//
//	return 0;
//}

////程序7 二维数组的使用
//int main()
//{
//	int arr[][4] = { {1,2},{3,4},{4,5} };
//	int i = 0;
//	int j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			printf("%d ", arr[i][j]);
//		}
//		printf("\n");
//	}
//
//	return 0;
//}

//程序8 二维数组在内存中的存储
//行可以省略，列不能省略的原因：列才能确定下一行的内存存储空间分配
int main()
{
	int arr[][4] = { {1,2},{3,4},{4,5} };
	int i = 0;
	int j = 0;
	for (i = 0; i < 3; i++)
	{
		for (j = 0; j < 4; j++)
		{
			printf("&arr[%d][%d] = %p\n", i, j, &arr[i][j]);
	//1.二维数组行相邻和列相邻的地址相隔4个字节，并且是连续存放的，即一行内部连续，换行也是连续
	//2.随着数组下标增长，地址是由低到高变化的
		}	
	}
	printf("-------------------------\n");
	//看地址怎么分布
	int* p = &arr[0][0];
	for (i = 0; i < 12; i++)
	{
		printf("%d ", *p);
		p++;
	}

	return 0;
}