#define _CRT_SECURE_NO_WARNINGS 1
//#include <stdio.h>
//int main()
//{
//	int i = 0;
//	double sum = 0;
//	scanf("%d", &i);
//	if (i > 1000000)
//	{
//		sum = (i - 1000000) * 0.01;
//		i = i - (i - 1000000);		//处理大于1000000
//	}
//	switch (i / 100000)
//	{
//	case 10:
//	case 9:
//	case 8:
//	case 7:
//	case 6:
//		sum += (i - 600000) * 0.015;	//处理大于600000
//		i = i - (i - 600000);
//	case 5:
//	case 4:
//		sum += (i - 400000) * 0.03;		//处理大于400000
//		i = i - (i - 400000);
//	case 3:
//	case 2:
//		sum += (i - 200000) * 0.05;		//处理大于200000
//		i = i - (i - 200000);
//	case 1:
//		sum += (i -100000) * 0.075;		//处理大于100000
//		i = i - (i - 100000);
///*	case 0:
//		sum += i * 0.1;	*/				//处理小于100000
//	}
//	printf("%.1f", sum);				//打印结果
//	return 0;
//}


//#include <stdio.h>
//#include <math.h>
//int main()
//{
//	float a, b, c;
//	scanf("%f%f%f", &a, &b, &c);    //输入三个数字
//	double t1 = b * b - 4.0 * a * c;//计算Δ用作后面判断
//	double t2 = 0, t3 = 0;
//	double x1 = 0, x2 = 0;
//	if (a == 0 && b == 0 & c == 0)
//		printf("Zero Equation");//三个数字为零的情况
//	else if (a == 0 && b == 0 & c != 0)
//		printf("Not An Equation");//c不为零的情况
//	else if (a == 0 && b != 0 && c != 0)
//	{
//		x1 = (-c) / (b * 1.00);
//		printf("%.2f", x1);//b，c不为零的情况
//	}
//	else if (t1 == 0)
//	{
//		x1 = (-b) / (2.0 * a);
//		printf("%.2f", x1);//只有一个实数根
//	}
//	else if (t1 > 0)//两个实数根
//	{
//		t2 = sqrt(t1);
//		x1 = ((-b) + t2) / (2.0 * a);
//		x2 = ((-b) - t2) / (2.0 * a);
//		printf("%.2f\n%.2f", x1, x2);//按大小输出
//	}
//	else//Δ小于0，输出带复数
//	{
//		t3 = -t1;
//		t2 = sqrt(t3);
//		x2 = t2 / (2.0 * a);
//		x1 = (-b) / (2.0 * a);
//		if (x1 != 0 && x2 != 0)//实部不为零时输出
//		{
//			printf("%.2f+%.2fi\n", x1, x2);
//			printf("%.2f-%.2fi\n", x1, x2);
//		}
//		else//实数为零时输出
//		{
//			printf("0.00+%.2fi\n", x2);
//			printf("0.00-%.2fi", x2);
//		}
//	}
//
//	return 0;
//}

//#include<stdio.h>
//int main()
//{
//	int I = 0;
//	double s = 0.0; //奖金
//	scanf_s("%d", &I); //利润输入
//	if (I >= 1000000)  //利润大于一百万时
//	{
//		s = 39500.0 + (I * 1.0 - 1000000.0) * 0.01; //将前面的利润全算出，单独计算一百万之后的奖金
//		printf("%.4lf", s);
//	}
//	else if (s >= 0 && s < 1000000)
//		switch (I / 100000)  //抹去十万位之后的数作为范围
//		{
//		case 9:
//			s += (I * 1.0 - 600000) * 0.015;
//			I = 600000;  // 重新设定未发奖金的利润
//		case 8:
//			s += (I * 1.0 - 600000) * 0.015;
//			I = 600000;  // 重新设定未发奖金的利润
//		case 7:
//			s += (I * 1.0 - 600000) * 0.015;
//			I = 600000;  // 重新设定未发奖金的利润
//		case 6:
//			s += (I * 1.0 - 600000) * 0.015;
//			I = 600000;  // 重新设定未发奖金的利润
//		case 5:
//			s += (I * 1.0 - 400000) * 0.03;
//			I = 400000;  // 重新设定未发奖金的利润
//		case 4:
//			s += (I * 1.0 - 400000) * 0.03;
//			I = 400000;  // 重新设定未发奖金的利润
//		case 3:
//			s += (I * 1.0 - 200000) * 0.05;
//			I = 200000;  // 重新设定未发奖金的利润
//		case 2:
//			s += (I * 1.0 - 200000) * 0.05;
//			I = 200000;  // 重新设定未发奖金的利润
//		case 1:
//			s += (I * 1.0 - 100000) * 0.075;
//			I = 100000;  // 重新设定未发奖金的利润
//		case 0:
//			s += (I * 1.0) * 0.1;
//			printf("%.4lf", s);
//		}
//
//	return 0;
//}
#include <stdio.h>
int main()
{
	int a, b;
	for (a = 1,b = 1; a <= 100; a++)
	{
		if (b >= 20)
			break;
		if (b % 3 == 1)
		{
			b += 3;
			continue;
		}
		b -= 5;
	}
	printf("%d\n",a);
	return 0;
}