#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

////程序1 引入for循环
//int main()
//{
//	int i = 1;		//初始化会影响循环
//	while (i <= 10) //影响判断部分
//	{
//		printf("%d ", i);
//		i++;		//若i +=2;影响循环次数，调整部分
//	}
//	//代码多的时候3部分离得很远，可能出错，所以有for循环
//	return 0;
//}

////程序2 for循环，简化程序1
//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 10; i++)	//表达式1是初始化；表达式2是判断部分；表达式3是调整部分；
//	{
//		printf("%d ", i);		//循环语句
//	}//初始化到判断部分，若为真则到循环语句，再到调整部分，若为假直接到调整部分
//
//	return 0;
//}

////程序3 break和continue的场景
//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 10; i++)
//	{
//		//if (5 == i)
//		//	break;		//直接结束循环
//		if (5 == i)
//			continue;	//此处只是跳过了此次循环后面的printf，而没跳过i++
//		
//		printf("%d ", i);
//	}
//	return 0;
//}

////程序4 建议1：别在循环体里改变变量
//int main()
//{
//	int i = 0;
//	for (i = 1; i <= 10; i++)
//	{
//		printf("%d ", i);
//		//所以不建议在循环中修改循环变量i
//		//i = 5;//就会变成死循环
//		//i++;//改变意义
//		//此处也可以在for中不加i++，而在循环中加
//		int j = 0;
//		for (j = 0; j < 10; i++)	//例如嵌套的错误
//		{
//			printf("hehe\n");
//		}
//	}
//
//	return 0;
//}

////程序5  建议2：左闭右开
//int main()
//{
//	int arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i < 10; i++)//i=0是闭区间，i<10是开区间，就可以让10表示循环10次，有意义
//	{
//		printf("%d ", arr[i]);
//	}
//
//	return 0;
//}

////程序6 for循环的变种1
//int main()
//{
//	/*//判断部分的省略，则判断部分恒定为真
//	for (;;)
//	{
//		printf("hehe\n");
//	}*/
//
//	int i = 0;
//	int j = 0;
//	for (; i < 3; i++)
//	{
//		for (; j < 3; j++)		//初始部分不省略打印9次，初始部分省略打印3次
//		{
//			printf("hehe\n");		
//		}
//	}
//
//	return 0;
//}

////程序7 for循环的变种2
//int main()
//{
//	int x, y;
//	for (x = 0, y = 0; x < 2 && y < 5; ++x, y++)
//	{
//		printf("hehe\n");	//打印2次
//	}
//	
//	return 0;
//}

//程序8 观察题目看循环要循环几次
int main()
{
	int i = 0;
	int k = 0;
	for (i = 0, k = 0; k = 0; i++, k++)		//k=0，0为假，所以0次循环，如果是==就是一次循环
	{										//=是赋值运算符，==是关系运算符
		printf("hehe\n");
		k++;
	}

	return 0;
}