#define _CRT_SECURE_NO_WARNINGS 1
#include <stdio.h>

////程序1 例子
//int main()
//{
//	int n = 9;
//	float* pFloat = (float*)&n;
//	printf("n的值为：%d\n", n);//9
//	printf("*pFloat的值为：%f\n", *pFloat);//0.0
//
//	*pFloat = 9.0;
//	printf("num的值为：%d\n", n);//1091567616
//	printf("*pFloat的值为：%f\n", *pFloat);//9.0
//
//	return 0;
//}

////程序2 浮点数存储
//int main()
//{
//	//数据放进去的过程：
//	float a = 5.5f;
//	//101.1
//	//1.011 * 2^2
//	//S=0  M=1.011  E=2
//	//S=0  M=011    E=2+127
//	//
//	//0100 0000 1011 0000 0000 0000 0000 0000
//	//40 b0 00 00
//	//
//	//取出来
//	//1.E不为全1或全0	--		怎么存就怎么取
//	//2.E全0			--		E等于1-127（或者1-1023），有效数字M不再加上第一位的1
//	//3.E全1			--		这时，如果有效数字M全为0，表示±无穷大（正负取决于符号位s）
//
//	return 0;
//}

//程序3 解读程序1的引子
int main()
{
	int n = 9;
	//00000000000000000000000000001001
	float* pFloat = (float*)&n;
	//0 00000000 00000000000000000001001
	//S E        M
	//+ 0.00000000000000000001001 * 2^(-126)
	printf("n的值为：%d\n", n);//9
	printf("*pFloat的值为：%f\n", *pFloat);//0.0	有效精确度只有6位小数

	*pFloat = 9.0;
	//1001.0
	//+ 1.001 * 2^3
	//S=0 E=3+127   M=001
	//0   10000010  00100000000000000000000
	printf("num的值为：%d\n", n);//1091567616
	printf("*pFloat的值为：%f\n", *pFloat);//9.0

	return 0;
}